tools/fio_rw_2025-12-17_210921.log
rand_rw_test: (g=0): rw=randrw, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=16
fio-3.36
Starting 1 process

rand_rw_test: (groupid=0, jobs=1): err= 0: pid=1977600: Wed Dec 17 21:09:23 2025
  read: IOPS=91.8k, BW=359MiB/s (376MB/s)(512MiB/1427msec)
    slat (nsec): min=733, max=61608, avg=2364.98, stdev=1936.62
    clat (nsec): min=276, max=3695.1k, avg=132864.10, stdev=146718.03
     lat (nsec): min=1047, max=3700.4k, avg=135229.08, stdev=147029.99
    clat percentiles (nsec):
     |  1.00th=[    302],  5.00th=[    350], 10.00th=[   2864],
     | 20.00th=[   7584], 30.00th=[  14528], 40.00th=[  71168],
     | 50.00th=[ 107008], 60.00th=[ 140288], 70.00th=[ 191488],
     | 80.00th=[ 248832], 90.00th=[ 317440], 95.00th=[ 370688],
     | 99.00th=[ 489472], 99.50th=[ 536576], 99.90th=[ 684032],
     | 99.95th=[2736128], 99.99th=[3522560]
   bw (  KiB/s): min=368896, max=372216, per=100.00%, avg=370556.00, stdev=2347.59, samples=2
   iops        : min=92224, max=93054, avg=92639.00, stdev=586.90, samples=2
  write: IOPS=91.9k, BW=359MiB/s (376MB/s)(512MiB/1427msec); 0 zone resets
    slat (nsec): min=1435, max=63540, avg=3141.05, stdev=2208.45
    clat (usec): min=12, max=3484, avg=34.84, stdev=38.87
     lat (usec): min=17, max=3487, avg=37.98, stdev=38.97
    clat percentiles (usec):
     |  1.00th=[   20],  5.00th=[   23], 10.00th=[   25], 20.00th=[   28],
     | 30.00th=[   30], 40.00th=[   32], 50.00th=[   34], 60.00th=[   36],
     | 70.00th=[   38], 80.00th=[   41], 90.00th=[   46], 95.00th=[   51],
     | 99.00th=[   69], 99.50th=[   79], 99.90th=[  110], 99.95th=[  126],
     | 99.99th=[ 2802]
   bw (  KiB/s): min=366784, max=372000, per=100.00%, avg=369392.00, stdev=3688.27, samples=2
   iops        : min=91696, max=93000, avg=92348.00, stdev=922.07, samples=2
  lat (nsec)   : 500=3.34%, 750=0.07%, 1000=0.01%
  lat (usec)   : 2=0.40%, 4=2.57%, 10=5.73%, 20=6.00%, 50=48.90%
  lat (usec)   : 100=6.93%, 250=16.17%, 500=9.45%, 750=0.39%, 1000=0.01%
  lat (msec)   : 2=0.01%, 4=0.04%
  cpu          : usr=15.22%, sys=50.28%, ctx=86588, majf=0, minf=16
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=100.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.1%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=131040,131104,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=16

Run status group 0 (all jobs):
   READ: bw=359MiB/s (376MB/s), 359MiB/s-359MiB/s (376MB/s-376MB/s), io=512MiB (537MB), run=1427-1427msec
  WRITE: bw=359MiB/s (376MB/s), 359MiB/s-359MiB/s (376MB/s-376MB/s), io=512MiB (537MB), run=1427-1427msec

Disk stats (read/write):
  nvme0n1: ios=77705/128606, sectors=621640/1029136, merge=0/0, ticks=15790/2590, in_queue=18380, util=62.08%