tools/fio_rw_2025-12-17_211652.log
rand_rw_test: (g=0): rw=randrw, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=16
fio-3.36
Starting 1 process

rand_rw_test: (groupid=0, jobs=1): err= 0: pid=1982853: Wed Dec 17 21:16:54 2025
  read: IOPS=75.0k, BW=293MiB/s (307MB/s)(512MiB/1747msec)
    slat (nsec): min=705, max=40892, avg=2326.90, stdev=1906.61
    clat (nsec): min=275, max=8259.6k, avg=173126.87, stdev=287596.77
     lat (nsec): min=1025, max=8261.9k, avg=175453.77, stdev=287778.52
    clat percentiles (nsec):
     |  1.00th=[    294],  5.00th=[    318], 10.00th=[   2008],
     | 20.00th=[   5792], 30.00th=[  12352], 40.00th=[  72192],
     | 50.00th=[ 110080], 60.00th=[ 146432], 70.00th=[ 203776],
     | 80.00th=[ 268288], 90.00th=[ 362496], 95.00th=[ 489472],
     | 99.00th=[1662976], 99.50th=[1908736], 99.90th=[2375680],
     | 99.95th=[2801664], 99.99th=[6651904]
   bw (  KiB/s): min=151416, max=372912, per=97.55%, avg=292674.67, stdev=122710.32, samples=3
   iops        : min=37854, max=93228, avg=73168.67, stdev=30677.58, samples=3
  write: IOPS=75.0k, BW=293MiB/s (307MB/s)(512MiB/1747msec); 0 zone resets
    slat (nsec): min=1430, max=74274, avg=3074.17, stdev=2182.21
    clat (usec): min=11, max=6412, avg=33.77, stdev=32.69
     lat (usec): min=17, max=6413, avg=36.85, stdev=32.89
    clat percentiles (usec):
     |  1.00th=[   19],  5.00th=[   22], 10.00th=[   23], 20.00th=[   26],
     | 30.00th=[   28], 40.00th=[   30], 50.00th=[   32], 60.00th=[   34],
     | 70.00th=[   37], 80.00th=[   40], 90.00th=[   45], 95.00th=[   52],
     | 99.00th=[   87], 99.50th=[   98], 99.90th=[  115], 99.95th=[  121],
     | 99.99th=[  139]
   bw (  KiB/s): min=151464, max=370064, per=97.23%, avg=291858.67, stdev=121848.78, samples=3
   iops        : min=37866, max=92516, avg=72964.67, stdev=30462.19, samples=3
  lat (nsec)   : 500=4.47%, 750=0.11%, 1000=0.01%
  lat (usec)   : 2=0.40%, 4=2.89%, 10=5.65%, 20=5.61%, 50=47.56%
  lat (usec)   : 100=6.97%, 250=14.89%, 500=9.02%, 750=0.99%, 1000=0.35%
  lat (msec)   : 2=0.92%, 4=0.15%, 10=0.01%
  cpu          : usr=11.00%, sys=43.36%, ctx=91177, majf=0, minf=16
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=100.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.1%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=131040,131104,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=16

Run status group 0 (all jobs):
   READ: bw=293MiB/s (307MB/s), 293MiB/s-293MiB/s (307MB/s-307MB/s), io=512MiB (537MB), run=1747-1747msec
  WRITE: bw=293MiB/s (307MB/s), 293MiB/s-293MiB/s (307MB/s-307MB/s), io=512MiB (537MB), run=1747-1747msec

Disk stats (read/write):
  nvme0n1: ios=74242/122760, sectors=593936/982080, merge=0/0, ticks=20436/2420, in_queue=22855, util=67.28%