tools/fio_rw_2025-12-17_212003.log
rand_rw_test: (g=0): rw=randrw, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=16
fio-3.36
Starting 1 process

rand_rw_test: (groupid=0, jobs=1): err= 0: pid=1992255: Wed Dec 17 21:20:04 2025
  read: IOPS=91.6k, BW=358MiB/s (375MB/s)(512MiB/1430msec)
    slat (nsec): min=744, max=76515, avg=2371.79, stdev=1910.48
    clat (nsec): min=281, max=8162.2k, avg=132835.55, stdev=153729.69
     lat (nsec): min=1084, max=8163.9k, avg=135207.34, stdev=153991.49
    clat percentiles (nsec):
     |  1.00th=[    298],  5.00th=[    350], 10.00th=[   2832],
     | 20.00th=[   7456], 30.00th=[  14144], 40.00th=[  71168],
     | 50.00th=[ 107008], 60.00th=[ 140288], 70.00th=[ 191488],
     | 80.00th=[ 248832], 90.00th=[ 317440], 95.00th=[ 370688],
     | 99.00th=[ 485376], 99.50th=[ 536576], 99.90th=[ 692224],
     | 99.95th=[ 806912], 99.99th=[3588096]
   bw (  KiB/s): min=367848, max=371536, per=100.00%, avg=369692.00, stdev=2607.81, samples=2
   iops        : min=91962, max=92884, avg=92423.00, stdev=651.95, samples=2
  write: IOPS=91.7k, BW=358MiB/s (376MB/s)(512MiB/1430msec); 0 zone resets
    slat (nsec): min=1442, max=82026, avg=3103.11, stdev=2160.47
    clat (usec): min=13, max=7684, avg=35.14, stdev=61.07
     lat (usec): min=17, max=7686, avg=38.24, stdev=61.12
    clat percentiles (usec):
     |  1.00th=[   20],  5.00th=[   23], 10.00th=[   25], 20.00th=[   28],
     | 30.00th=[   30], 40.00th=[   31], 50.00th=[   34], 60.00th=[   36],
     | 70.00th=[   38], 80.00th=[   41], 90.00th=[   46], 95.00th=[   51],
     | 99.00th=[   69], 99.50th=[   75], 99.90th=[   92], 99.95th=[  113],
     | 99.99th=[ 2900]
   bw (  KiB/s): min=367776, max=369336, per=100.00%, avg=368556.00, stdev=1103.09, samples=2
   iops        : min=91944, max=92334, avg=92139.00, stdev=275.77, samples=2
  lat (nsec)   : 500=3.35%, 750=0.05%, 1000=0.01%
  lat (usec)   : 2=0.32%, 4=2.69%, 10=5.83%, 20=5.94%, 50=48.79%
  lat (usec)   : 100=6.99%, 250=16.04%, 500=9.55%, 750=0.38%, 1000=0.01%
  lat (msec)   : 2=0.01%, 4=0.02%, 10=0.01%
  cpu          : usr=15.33%, sys=49.97%, ctx=86286, majf=0, minf=16
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=100.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.1%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=131040,131104,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=16

Run status group 0 (all jobs):
   READ: bw=358MiB/s (375MB/s), 358MiB/s-358MiB/s (375MB/s-375MB/s), io=512MiB (537MB), run=1430-1430msec
  WRITE: bw=358MiB/s (376MB/s), 358MiB/s-358MiB/s (376MB/s-376MB/s), io=512MiB (537MB), run=1430-1430msec

Disk stats (read/write):
  nvme0n1: ios=77617/128479, sectors=620936/1027832, merge=0/0, ticks=15780/2636, in_queue=18417, util=63.08%