tools/fio_rw_2025-12-17_221846.log
rand_rw_test: (g=0): rw=randrw, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=16
fio-3.36
Starting 1 process

rand_rw_test: (groupid=0, jobs=1): err= 0: pid=2013710: Wed Dec 17 22:18:48 2025
  read: IOPS=91.2k, BW=356MiB/s (374MB/s)(512MiB/1437msec)
    slat (nsec): min=727, max=60230, avg=2249.02, stdev=1846.51
    clat (nsec): min=281, max=3553.1k, avg=135042.20, stdev=143407.65
     lat (nsec): min=1050, max=3554.7k, avg=137291.21, stdev=143724.38
    clat percentiles (nsec):
     |  1.00th=[    298],  5.00th=[    326], 10.00th=[   2576],
     | 20.00th=[   6304], 30.00th=[  12224], 40.00th=[  72192],
     | 50.00th=[ 109056], 60.00th=[ 144384], 70.00th=[ 195584],
     | 80.00th=[ 254976], 90.00th=[ 321536], 95.00th=[ 382976],
     | 99.00th=[ 509952], 99.50th=[ 561152], 99.90th=[ 708608],
     | 99.95th=[ 839680], 99.99th=[3063808]
   bw (  KiB/s): min=360760, max=365976, per=99.62%, avg=363368.00, stdev=3688.27, samples=2
   iops        : min=90190, max=91494, avg=90842.00, stdev=922.07, samples=2
  write: IOPS=91.2k, BW=356MiB/s (374MB/s)(512MiB/1437msec); 0 zone resets
    slat (nsec): min=1421, max=40391, avg=3013.67, stdev=2132.19
    clat (usec): min=3, max=2991, avg=34.11, stdev=33.44
     lat (usec): min=16, max=2997, avg=37.12, stdev=33.62
    clat percentiles (usec):
     |  1.00th=[   20],  5.00th=[   22], 10.00th=[   24], 20.00th=[   27],
     | 30.00th=[   29], 40.00th=[   31], 50.00th=[   32], 60.00th=[   34],
     | 70.00th=[   37], 80.00th=[   39], 90.00th=[   44], 95.00th=[   49],
     | 99.00th=[   88], 99.50th=[  104], 99.90th=[  131], 99.95th=[  147],
     | 99.99th=[ 2704]
   bw (  KiB/s): min=358856, max=365656, per=99.27%, avg=362256.00, stdev=4808.33, samples=2
   iops        : min=89714, max=91414, avg=90564.00, stdev=1202.08, samples=2
  lat (nsec)   : 500=3.74%, 750=0.03%, 1000=0.01%
  lat (usec)   : 2=0.51%, 4=2.91%, 10=6.25%, 20=5.48%, 50=48.40%
  lat (usec)   : 100=6.29%, 250=16.02%, 500=9.80%, 750=0.52%, 1000=0.02%
  lat (msec)   : 2=0.01%, 4=0.02%
  cpu          : usr=15.32%, sys=47.42%, ctx=85300, majf=0, minf=14
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=100.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.1%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=131040,131104,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=16

Run status group 0 (all jobs):
   READ: bw=356MiB/s (374MB/s), 356MiB/s-356MiB/s (374MB/s-374MB/s), io=512MiB (537MB), run=1437-1437msec
  WRITE: bw=356MiB/s (374MB/s), 356MiB/s-356MiB/s (374MB/s-374MB/s), io=512MiB (537MB), run=1437-1437msec

Disk stats (read/write):
  nvme0n1: ios=77195/127813, sectors=617560/1022752, merge=0/0, ticks=16054/2576, in_queue=18630, util=63.48%